_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_33 (Conv2D)           (None, 22, 22, 32)        608       
_________________________________________________________________
activation_49 (Activation)   (None, 22, 22, 32)        0         
_________________________________________________________________
conv2d_34 (Conv2D)           (None, 20, 20, 32)        9248      
_________________________________________________________________
activation_50 (Activation)   (None, 20, 20, 32)        0         
_________________________________________________________________
max_pooling2d_17 (MaxPooling (None, 10, 10, 32)        0         
_________________________________________________________________
dropout_25 (Dropout)         (None, 10, 10, 32)        0         
_________________________________________________________________
conv2d_35 (Conv2D)           (None, 10, 10, 64)        18496     
_________________________________________________________________
activation_51 (Activation)   (None, 10, 10, 64)        0         
_________________________________________________________________
conv2d_36 (Conv2D)           (None, 8, 8, 64)          36928     
_________________________________________________________________
activation_52 (Activation)   (None, 8, 8, 64)          0         
_________________________________________________________________
max_pooling2d_18 (MaxPooling (None, 4, 4, 64)          0         
_________________________________________________________________
dropout_26 (Dropout)         (None, 4, 4, 64)          0         
_________________________________________________________________
flatten_9 (Flatten)          (None, 1024)              0         
_________________________________________________________________
dense_17 (Dense)             (None, 512)               524800    
_________________________________________________________________
activation_53 (Activation)   (None, 512)               0         
_________________________________________________________________
dropout_27 (Dropout)         (None, 512)               0         
_________________________________________________________________
dense_18 (Dense)             (None, 2)                 1026      
_________________________________________________________________
activation_54 (Activation)   (None, 2)                 0         
=================================================================
Total params: 591,106
Trainable params: 591,106
Non-trainable params: 0
_________________________________________________________________
