Model: "sequential_8"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_29 (Conv2D)           (None, 52, 52, 32)        608       
_________________________________________________________________
activation_43 (Activation)   (None, 52, 52, 32)        0         
_________________________________________________________________
conv2d_30 (Conv2D)           (None, 50, 50, 32)        9248      
_________________________________________________________________
activation_44 (Activation)   (None, 50, 50, 32)        0         
_________________________________________________________________
max_pooling2d_15 (MaxPooling (None, 25, 25, 32)        0         
_________________________________________________________________
dropout_22 (Dropout)         (None, 25, 25, 32)        0         
_________________________________________________________________
conv2d_31 (Conv2D)           (None, 25, 25, 64)        18496     
_________________________________________________________________
activation_45 (Activation)   (None, 25, 25, 64)        0         
_________________________________________________________________
conv2d_32 (Conv2D)           (None, 23, 23, 64)        36928     
_________________________________________________________________
activation_46 (Activation)   (None, 23, 23, 64)        0         
_________________________________________________________________
max_pooling2d_16 (MaxPooling (None, 11, 11, 64)        0         
_________________________________________________________________
dropout_23 (Dropout)         (None, 11, 11, 64)        0         
_________________________________________________________________
flatten_8 (Flatten)          (None, 7744)              0         
_________________________________________________________________
dense_15 (Dense)             (None, 512)               3965440   
_________________________________________________________________
activation_47 (Activation)   (None, 512)               0         
_________________________________________________________________
dropout_24 (Dropout)         (None, 512)               0         
_________________________________________________________________
dense_16 (Dense)             (None, 2)                 1026      
_________________________________________________________________
activation_48 (Activation)   (None, 2)                 0         
=================================================================
Total params: 4,031,746
Trainable params: 4,031,746
Non-trainable params: 0
_________________________________________________________________
