Model: "sequential_4"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_13 (Conv2D)           (None, 46, 46, 32)        608       
_________________________________________________________________
activation_19 (Activation)   (None, 46, 46, 32)        0         
_________________________________________________________________
conv2d_14 (Conv2D)           (None, 44, 44, 32)        9248      
_________________________________________________________________
activation_20 (Activation)   (None, 44, 44, 32)        0         
_________________________________________________________________
max_pooling2d_7 (MaxPooling2 (None, 22, 22, 32)        0         
_________________________________________________________________
dropout_10 (Dropout)         (None, 22, 22, 32)        0         
_________________________________________________________________
conv2d_15 (Conv2D)           (None, 22, 22, 64)        18496     
_________________________________________________________________
activation_21 (Activation)   (None, 22, 22, 64)        0         
_________________________________________________________________
conv2d_16 (Conv2D)           (None, 20, 20, 64)        36928     
_________________________________________________________________
activation_22 (Activation)   (None, 20, 20, 64)        0         
_________________________________________________________________
max_pooling2d_8 (MaxPooling2 (None, 10, 10, 64)        0         
_________________________________________________________________
dropout_11 (Dropout)         (None, 10, 10, 64)        0         
_________________________________________________________________
flatten_4 (Flatten)          (None, 6400)              0         
_________________________________________________________________
dense_7 (Dense)              (None, 512)               3277312   
_________________________________________________________________
activation_23 (Activation)   (None, 512)               0         
_________________________________________________________________
dropout_12 (Dropout)         (None, 512)               0         
_________________________________________________________________
dense_8 (Dense)              (None, 2)                 1026      
_________________________________________________________________
activation_24 (Activation)   (None, 2)                 0         
=================================================================
Total params: 3,343,618
Trainable params: 3,343,618
Non-trainable params: 0
_________________________________________________________________
